void setup(){
size(640,480);
}

void draw() {
  background(#87DEFC); //цвет неба
  fill(255, 207,49); //желтый
  ellipse(640, 0, 200, 200);//солнце
  fill(104,178,41);//зеленый
  rect(0, 400, 640, 200);//земля
  fill(150, 90, 60);//коричневый
  rect(90, 350, 20, 70);//ствол
  fill(59,118,8);//зеленый
  ellipse(100, 270, 100, 200);//крона
  fill(255, 255, 255);//белый
  rect(300, 220, 250, 200);//стена
  fill(154,250,233);//синий
  rect(350,270,100,100); // окно
  fill(183, 11, 11);//красный
  triangle(300, 220, 425, 100, 550, 220);//крыша
  line(50, 50, 70, 70);//птица
  line(70, 70, 120, 40);//птица
  noStroke();
  fill(255, 255, 255);//белый
  ellipse(200,80,50,50);//оюлако
  ellipse(230,70,60,60);//облако
  ellipse(210,100,40,40);//облако
  ellipse(250,90,70,70);//облако
  stroke(0);//
}
